---
title: Апрельская встреча
date: 2015-04-15
eventDate: 2015-04-30
author: Сергей Бушняк
---

В четверг, 30 апреля, состоится четвертая встреча OdHUG в 2015 году.

Встречаемся в **КА ШАГ** (Еврейская, 3) в **19.00**.

[**Регистрация на встречу**](https://docs.google.com/forms/d/1HXNwr3QA_ySa4GgqMtfZLmhwELPH-_eFB-X6xiJ-Hkc/viewform)

Встреча будет посвящена "Разработке компиляторо в Haskell". 

- Я подготовлю доклад "Разработка компилятора VHDL на Haskell" в котором постараюсь затронуть как основы так и конкретные примеры.
- Несколько Lightning Talk выступлений

Если у вас есть интересный материал или чем поделиться [зарегистрируйтесь](https://docs.google.com/forms/d/1X52TCJ2yar8EP9O9E3GMqOreMLO9H631X_gGQeueAA8/) в списке докладчиков.

Формат Lightning Talk - это короткое выступление - 10-15 минут, где вы можете поделиться каким-то интересными вещами. Разобрались с интересной Haskell библиотекой или расширением GHC, нашли интересный хак или область применения. Расскажите всем! [регистрация](https://docs.google.com/forms/d/11UjvTaux2CbhnZinpUfhYo5VweyUFsHVFmWG0QYXj58/viewform)

Репосты, распространение и продвижение приветствуется!


